# Séries

In [ ]:
import pandas as pd

In [ ]:
serie = pd.Series([4, 7, -5, 3])
serie

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
serie.values

array([ 4,  7, -5,  3])

In [ ]:
serie.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
serie2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print(serie2)
print(serie2.index)

d    4
b    7
a   -5
c    3
dtype: int64
Index(['d', 'b', 'a', 'c'], dtype='object')

In [ ]:
print(serie2['a'])

-5

In [ ]:
serie2['d'] = 6
print(serie2)

d    6
b    7
a   -5
c    3
dtype: int64

In [ ]:
serie2[['d', 'a', 'd']]

d    6
a   -5
d    6
dtype: int64

In [ ]:
serie2[serie2 > 0]

d    6
b    7
c    3
dtype: int64

In [ ]:
'b' in serie2

True

In [ ]:
cidades = { 'Fortaleze': 8000, 'Quixada': 25000, 'Horizonte': 76000, 'Jaguaribe': 15000 }

serie3 = pd.Series(cidades)
serie3

Fortaleze     8000
Quixada      25000
Horizonte    76000
Jaguaribe    15000
dtype: int64

# DataFrame

In [ ]:
dados = { 'cidade': ['Fortaleza', 'Sobral', 'Camucim', 'Quixada', 'Jaguaribe', 'Russas'],
          'ano': [2000, 2001, 2002, 2000, 2001, 2002],
          'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
        }

df = pd.DataFrame(dados)
df

      cidade   ano  pop
0  Fortaleza  2000  1.5
1     Sobral  2001  1.7
2    Camucim  2002  3.6
3    Quixada  2000  2.4
4  Jaguaribe  2001  2.9
5     Russas  2002  3.2

In [ ]:
df.head()

      cidade   ano  pop
0  Fortaleza  2000  1.5
1     Sobral  2001  1.7
2    Camucim  2002  3.6
3    Quixada  2000  2.4
4  Jaguaribe  2001  2.9

In [ ]:
df

      cidade   ano  pop
0  Fortaleza  2000  1.5
1     Sobral  2001  1.7
2    Camucim  2002  3.6
3    Quixada  2000  2.4
4  Jaguaribe  2001  2.9
5     Russas  2002  3.2

In [ ]:
pd.DataFrame(df, columns=['ano', 'cidade', 'pop'])

    ano     cidade  pop
0  2000  Fortaleza  1.5
1  2001     Sobral  1.7
2  2002    Camucim  3.6
3  2000    Quixada  2.4
4  2001  Jaguaribe  2.9
5  2002     Russas  3.2

In [ ]:
df2 = pd.DataFrame(dados, columns=['ano', 'cidade', 'pop', 'idh'], index=['um', 'dois', 'tres', 'quatro', 'cinco', 'seis'])

df2

         ano     cidade  pop  idh
um      2000  Fortaleza  1.5  NaN
dois    2001     Sobral  1.7  NaN
tres    2002    Camucim  3.6  NaN
quatro  2000    Quixada  2.4  NaN
cinco   2001  Jaguaribe  2.9  NaN
seis    2002     Russas  3.2  NaN

In [ ]:
df2['cidade']

um        Fortaleza
dois         Sobral
tres        Camucim
quatro      Quixada
cinco     Jaguaribe
seis         Russas
Name: cidade, dtype: object

In [ ]:
df2['idh'] = 16.2
df2

         ano     cidade  pop   idh
um      2000  Fortaleza  1.5  16.2
dois    2001     Sobral  1.7  16.2
tres    2002    Camucim  3.6  16.2
quatro  2000    Quixada  2.4  16.2
cinco   2001  Jaguaribe  2.9  16.2
seis    2002     Russas  3.2  16.2